class HttpStatusCode {
  static final Map<int, String> map = <int, String>{
    0: "服务器无法访问!",
    100: "正在等待其余部分!",
    101: "切换协议!",
    200: "请求成功!",
    201: "请求成功并且服务器创建了新的资源!",
    202: "服务器已接受请求，但尚未处理!",
    203: "非授权信息!",
    204: "无内容!",
    205: "重置内容!",
    206: "部分内容!",
    300: "多种选择!",
    301: "永久移动!",
    302: "临时移动!",
    303: "查看其他位置!",
    304: "内容未修改!",
    305: "使用代理!",
    306: "(Unused)",
    307: "临时重定向!",
    400: "错误请求!",
    401: "接口未授权!",
    402: "Payment Required",
    403: "服务器拒绝请求!",
    404: "请求的不存在!",
    405: "禁用请求!",
    406: "无法使用请求的内容特性响应请求的网页!",
    407: "需要代理授权!",
    408: "服务器请求超时!",
    409: "冲突!",
    410: "请求的资源已永久删除!",
    411: "需要有效长度!",
    412: "未满足前提条件!",
    413: "请求实体过大!",
    414: "请求的 URI 过长!",
    415: "不支持的媒体类型!",
    416: "请求范围不符合要求!",
    417: "未满足期望值!",
    500: "服务器内部错误!",
    501: "尚未实施!",
    502: "错误网关!",
    503: "服务不可用!",
    504: "网关超时!",
    505: "HTTP 版本不受支持!"
  };

  static String getHttpStatusMsg(int code) {
    if (map.containsKey(code)) {
      return map[code];
    }
    return "未知错误!";
  }
}
